package com.practice.get_set_class_as_parameter;

//2. Создать класс Самолет ( Airplane ) с полями:
//        - producer (изготовитель)
//        - year (год выпуска)
//        - length (длина)
//        - weight (вес)
//        - fuel (количество топлива в баке) + геттер для этого поля
//        Создать конструктор в классе Самолет, принимающий в качестве аргументов значения
//        четырех полей класса (значение поля “количество топлива в баке” установить равным 0)
//В конструкторе для передачи полям значений использовать ключевое слово this .
//        Помимо этого, в классе необходимо реализовать метод info() , который выводит
//        сообщение в следующем формате:
//        “Изготовитель: … , год выпуска: … , длина: ..., вес: ..., количество топлива в баке: …”
//        Также, необходимо реализовать метод fillUp() , который в качестве аргумента
//        принимает число и заправляет топливный бак самолета на это значение.

public class Task2 {
    public static void main(String[] args) {
        Airplane plane1 = new Airplane("Boing",2018,200,5000);
        plane1.info();
        plane1.fillUp(500);
        plane1.info();
    //        Создать новый объект класса Самолет с произвольными данными.
//        Изменить год выпуска и длину с помощью сеттеров, вызвать метод fillUp() два
//        раза, передав разные значения. Вызвать метод info()
        Airplane plane2 = new Airplane("Aerobus",2015,215,4000);
        plane2.setYearBuilt(2016);
        plane2.setLength(210);
        plane2.fillUp(100);
        plane2.fillUp(200);
        plane2.info();

    }
}
